# Data Bootcamp Selection Challenge

##### In this challenge you will calculate various KPIs using a car based dataset, each question will have a single correct answer that will be evaluated through automated unit testing. Use the dictionary provided below to fill in your answers, each question will state the format required for the answer and examples are provided so you know how properly fill the answer dictionary. 

##### **Use the dataset "as is" and do not perform any data cleaning or modify it in any way, doing so could make you answer all your questions incorrectly. Do not modify the structure of the answer dictionary.**

##### When you finish this challenge please upload both your notebook and your answer dictionary in pickle format to a public github repository submit their URL to the [google form](https://forms.gle/wWysZEMkoZsjB11Y7) that was provided to you.

##### Some unit tests are provided at the end of this notebook to help you verify your answers are in the correct format, however they will not test everything.

In [169]:
#Use this dictionary to store your answers in the correct format in the cells below , do not modify the keys
answer_dict =  {"Q1" : Q1,
                "Q2" : Q2,
                "Q3" : Q3,
                "Q4" : Q4,
                "Q5" : Q5,
                "Q6" : Q6,
                "Q7" : Q7}

## Reading the dataset
##### An example is provided to read the dataset using [pandas](https://pandas.pydata.org/), while we reccommend using pandas you may use any python library to solve this challenge.

In [10]:
import pandas as pd
import numpy as np
url='https://drive.google.com/file/d/1PCJ7ltluquoXKi6MYTPMfwZQNI_-MIFP/view?usp=sharing'
url='https://drive.google.com/uc?id=' + url.split('/')[-2]
df = pd.read_csv(url)

In [ ]:
df.head()

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35952 entries, 0 to 35951
Data columns (total 15 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Make                     35952 non-null  object
 1   Model                    35952 non-null  object
 2   Year                     35952 non-null  int64
 3   Engine Displacement      35952 non-null  float64
 4   Cylinders                35952 non-null  float64
 5   Transmission             35952 non-null  object
 6   Drivetrain               35952 non-null  object
 7   Vehicle Class            35952 non-null  object
 8   Fuel Type                35952 non-null  object
 9   Fuel Barrels/Year        35952 non-null  float64
 10  City MPG                 35952 non-null  int64
 11  Highway MPG              35952 non-null  int64
 12  Combined MPG             35952 non-null  int64
 13  CO2 Emission Grams/Mile  35952 non-null  float64
 14  Fuel Cost/Year           35952 non-null  int64
dtypes: float64(4), int64(5), object(6)
memory usage: 4.1+ MB

## Q1. What is the average CO2 emmission per gram/mile of all Volkswagen cars?

##### Format: A floating number
##### Example answer:
 `11.547`

In [99]:
########## Q1
#Your code here
# Make the DF a variable with a more intitive name
cars = df

# Get only the 'Volkswagen' rows from the 'Make' colum and show only the data from 'CO2 Emission Grams/Mile'
# Assign it to a variable Volks to apply the mean function
volks = cars[cars.Make =='Volkswagen'][['CO2 Emission Grams/Mile']].mean()
volks

#Example answer:
#answer_dict["Q1"] =  11.547

CO2 Emission Grams/Mile    392.741721
dtype: float64

In [100]:
# To follow requested format select the unique value from the list and Add it to result variable a -Q1-
Q1 = volks.values.tolist()[0]
Q1

392.7417210857633

## Q2. Calculate the top 5 brands(Make) with the most unique models, order your answer in descending order with respect to the number of unique models.
##### **NOTE:** Consider only the name of the models and their brand, that is use only the Make and Model columns
##### Format: A 5X2 list with each row being the name of the brand followed by the unique number of models, in descending order.
##### Hint: You can use the pandas [df.values.tolist()](https://pandas.pydata.org/docs/reference/api/pandas.Series.tolist.html) function to format your answer.

##### Example answer: 
`[["Volkswagen", 1000], ["Toyota", 900], ["Honda", 800], ["Subaru", 700], ["Ford", 600]]`

In [14]:
########## Q2
#Your code here

#Example answer:
#answer_dict["Q2"] =  [["Volkswagen", 1000], ["Toyota", 900], ["Honda", 800], ["Subaru", 700], ["Ford", 600]]

In [111]:
# Groupby 'Make' and show the unique values from 'Models', show only the column 'Model' as a df 
# and assing it to a DF variable -gb-
gb = cars.groupby('Make').nunique('Models')[['Model']]
gb

                             Model
Make
AM General                       4
ASC Incorporated                 1
Acura                           39
Alfa Romeo                       8
American Motors Corporation      4
...                            ...
Volkswagen                      63
Volvo                           83
Wallace Environmental           18
Yugo                             4
smart                            3

[127 rows x 1 columns]

In [112]:
# Sort the -gb- dataframe with decending values using the 'Model' column items and assign it to a varible -gbtop- 
gbtop = gb.sort_values('Model',ascending=False).head(5)
gbtop

               Model
Make
Mercedes-Benz    333
BMW              284
Chevrolet        253
Ford             185
GMC              163

In [114]:
# Since we want to make a list from the dataframe and show the 'Make' items, we need to reset the index
# To verify, we assign it to a new variable -models- showing only the desired colums 'Make' and 'Model'
models = gbtop.reset_index()
models

            Make  Model
0  Mercedes-Benz    333
1            BMW    284
2      Chevrolet    253
3           Ford    185
4            GMC    163

In [115]:
# Transform the dataframe into a list and assign it to a variable Q2
Q2 = models.values.tolist()
Q2

[['Mercedes-Benz', 333],
 ['BMW', 284],
 ['Chevrolet', 253],
 ['Ford', 185],
 ['GMC', 163]]

## Q3. What are all the different types of fuels in the dataset sorted alphabetically?

##### Format: A list of strings sorted alphabetically.
##### Example Answer: 
`['Regular',
 'Premium']`

In [18]:
########## Q3
#Your code here


#Example answer:
#answer_dict["Q3"] =  ['Regular', 'Premium']

In [166]:
# We call the column 'Fuel Type' apply the unique function, we sort alphabetically
# and get all the different types then make it a list
Q3 = cars['Fuel Type'].sort_values().unique().tolist()
Q3

['CNG',
 'Diesel',
 'Gasoline or E85',
 'Gasoline or natural gas',
 'Gasoline or propane',
 'Midgrade',
 'Premium',
 'Premium Gas or Electricity',
 'Premium and Electricity',
 'Premium or E85',
 'Regular',
 'Regular Gas and Electricity',
 'Regular Gas or Electricity']

## Q4. Show the 9 Toyota cars with the most extreme Fuel Barrels/Year in abosolute terms within all Toyota cars. 

- [x] Show the car Model, Year and their Fuel Barrels/Year in standard deviation units([Z-score](https://fredclavel.org/2019/03/18/basics-standardization-and-the-z-score/)) 
- [x] **sorted** in descending order by their Fuel Barrels/Year in absolute terms first and
- [x] then by year in descending order 
- [x] **BUT** without modifying the negative values (see example).

##### Format: A 9X3 list with each row containing the Model, Year and Fuel Barrels/Year in standard deviations units

##### Example answer: 
```
[['DJ Po Vehicle 2WD', 2004, -6.407431084026927],
 ['FJ8c Post Office', 2003, -6.407431084026927],
 ['Post Office DJ5 2WD', 2005, -6.391684618442447],
 ['Sierra 2500 Hd 2WD', 2002, -6.391684618442447],
 ['Camry CNG', 2012, 2.677633075759575],
 ['Sierra 1500 4WD', 2005, 2.677633075759575],
 ['Sierra 1500 4WD', 2001, 2.677633075759575],
 ['V15 Suburban 4WD', 1988, 2.677633075759575],
 ['V15 Suburban 4WD', 1987, 2.677633075759575]]
```
##### Note that while the list is sorted by the Fuel Barrels/Year in absolute terms and in standard deviation units, the values are not modified. If the values are the same the rows are sorted by the year.

In [142]:
########## Q4
#Your code here

# Get only the Toyota cars and the columns 'Make', 'Model', 'Year' and 'Fuel Barrels/Year' 
# and assign it to a variable -toyotas-
toyotas = cars[cars.Make == 'Toyota'][['Model', 'Year','Fuel Barrels/Year']]
toyotas

                 Model  Year  Fuel Barrels/Year
32281  1-Ton Truck 2WD  1985          15.695714
32282  1-Ton Truck 2WD  1985          15.695714
32283  1-Ton Truck 2WD  1986          15.695714
32284  1-Ton Truck 2WD  1986          14.330870
32285  1-Ton Truck 2WD  1987          15.695714
...                ...   ...                ...
34112            Yaris  2016           9.988182
34113            Yaris  2017          10.300313
34114            Yaris  2017           9.988182
34115         Yaris iA  2017           9.694412
34116         Yaris iA  2017           9.417429

[1836 rows x 3 columns]

In [143]:
# to make the Z Score: By definition Z Score=( data - sample mean )/(sample standar deviation)

# to make the Z Score: get the mean for the 'Fuel Barrels/Year' and asign it to a new variable -fuelmean-
fuelmean = toyotas['Fuel Barrels/Year'].mean()
fuelmean

16.153677357417322

In [144]:
# to make the Z Score: get the standar deviation for the 'Fuel Barrels/Year' and asign it to a new variable -fuelstd-
fuelstd = toyotas['Fuel Barrels/Year'].std()
fuelstd

4.0871295932473535

In [145]:
# to make the Z Score: we use the items from Zscore=(('Fuel Barrels/Year')-(fuel mean))/(fuel standar deviation)
zfuel = ( toyotas['Fuel Barrels/Year']-fuelmean )/fuelstd
zfuel

32281   -0.112050
32282   -0.112050
32283   -0.112050
32284   -0.445987
32285   -0.112050
           ...
34112   -1.508515
34113   -1.432146
34114   -1.508515
34115   -1.580392
34116   -1.648161
Name: Fuel Barrels/Year, Length: 1836, dtype: float64

In [146]:
# Create a new colum on the df -toyotas- called 'ZScore' with the -zfuel- list items
toyotas['ZScore']=zfuel
toyotas

                 Model  Year  Fuel Barrels/Year    ZScore
32281  1-Ton Truck 2WD  1985          15.695714 -0.112050
32282  1-Ton Truck 2WD  1985          15.695714 -0.112050
32283  1-Ton Truck 2WD  1986          15.695714 -0.112050
32284  1-Ton Truck 2WD  1986          14.330870 -0.445987
32285  1-Ton Truck 2WD  1987          15.695714 -0.112050
...                ...   ...                ...       ...
34112            Yaris  2016           9.988182 -1.508515
34113            Yaris  2017          10.300313 -1.432146
34114            Yaris  2017           9.988182 -1.508515
34115         Yaris iA  2017           9.694412 -1.580392
34116         Yaris iA  2017           9.417429 -1.648161

[1836 rows x 4 columns]

In [147]:
# sort the values first for 'ZScore' ascending in absolutes and then for 'Year' descending,
# then show only the first 9 rows
toyotopz = toyotas.sort_values(['ZScore','Year'],ascending=[False,False],key=abs).head(9)
#**toyotopz = toyotas[['Model','ZScore','Year']].head(15)
toyotopz

                 Model  Year  Fuel Barrels/Year    ZScore
32481  Cab/Chassis 2WD  1993          32.961000  4.112256
32479  Cab/Chassis 2WD  1992          32.961000  4.112256
32477  Cab/Chassis 2WD  1991          32.961000  4.112256
32475  Cab/Chassis 2WD  1990          32.961000  4.112256
32473  Cab/Chassis 2WD  1989          32.961000  4.112256
32600        Camry CNG  1999           0.080870 -3.932542
32602        Camry CNG  2001           0.084545 -3.931642
32601        Camry CNG  2000           0.084545 -3.931642
32482  Cab/Chassis 2WD  1993          29.964545  3.379112

In [148]:
# Show only the 'Model', 'Year' and 'ZScore' columns
# and assign the result to the variable -Q4- with values as list
Q4 = toyotopz[['Model','Year','ZScore']].values.tolist()
Q4

[['Cab/Chassis 2WD', 1993, 4.1122558654247925],
 ['Cab/Chassis 2WD', 1992, 4.1122558654247925],
 ['Cab/Chassis 2WD', 1991, 4.1122558654247925],
 ['Cab/Chassis 2WD', 1990, 4.1122558654247925],
 ['Cab/Chassis 2WD', 1989, 4.1122558654247925],
 ['Camry CNG', 1999, -3.932541757118491],
 ['Camry CNG', 2001, -3.9316423754756538],
 ['Camry CNG', 2000, -3.9316423754756538],
 ['Cab/Chassis 2WD', 1993, 3.3791118637260937]]

## Q5. Calculate the changes in Combined MPG with their previous model of all Golf cars with Manual 5-spd transmission and Regular Fuel Type. Show the Year, the Combined MPG and the calculated difference of MPG in a list sorted by Year in ascending order.

##### Format: A 19X3 list, with the Year and Combined MPG being of type integer **and only the calculated difference is of type float**
##### **Note: The value for the first model should be 0.** It does not matter that there are gaps in the years, calculate with respect the previous model.

##### Example answer:



```
[[1986, 25, 0.0],
 [1987, 25, 0.0],
 [1988, 25, 0.0],
 [1989, 25, 0.0],
 [1990, 23, -2.0],
 [1991, 23, 0.0],
 [1992, 24, 1.0],
 [1993, 25, 1.0],
 [1994, 25, 0.0],
 [1995, 25, 0.0],
 [1996, 25, 0.0],
 [1997, 25, 0.0],
 [1998, 24, -1.0],
 [1999, 25, 1.0],
 [2000, 24, -1.0],
 [2001, 24, 0.0],
 [2002, 24, 0.0],
 [2004, 24, 0.0],
 [2006, 24, 0.0]]
```

In [121]:
########## Q5
#Your code here
# Get only the Golf rows from 'Model' column and show only the columns 'Year', 'Tranmission', 'Fuel Type' 
# and 'Combined MPG' And assign it to a new df -golfs-
golfs = cars[cars.Model == 'Golf'][['Year', 'Transmission','Fuel Type','Combined MPG']]
golfs

       Year     Transmission Fuel Type  Combined MPG
34367  1986     Manual 5-spd    Diesel            35
34368  1986  Automatic 3-spd   Regular            22
34369  1986     Manual 5-spd   Regular            26
34370  1987     Manual 5-spd    Diesel            33
34371  1987  Automatic 3-spd   Regular            22
...     ...              ...       ...           ...
34434  2015     Manual 6-spd    Diesel            36
34435  2016   Automatic (S6)   Regular            29
34436  2016     Manual 5-spd   Regular            30
34437  2017   Automatic (S6)   Regular            29
34438  2017     Manual 5-spd   Regular            29

[72 rows x 4 columns]

In [122]:
# From the DF -golfs- get only the 'Manual 5-spd' rows from column 'Transmission', show the column 'Year', 
# 'Fuel Type' and 'C MPG' And Assign it to a new DF -golfsManual-
golfsManual = golfs[golfs.Transmission == 'Manual 5-spd'][['Year','Fuel Type','Combined MPG']]
golfsManual.head(3)

       Year Fuel Type  Combined MPG
34367  1986    Diesel            35
34369  1986   Regular            26
34370  1987    Diesel            33

In [124]:
# From the DF -golfsManual- get only the 'Regular' rows from column 'Fuel Type', show the column 'Year' and 'C MPG'
# Sort years ascending and assign it to a new DF -golfsMR-
golfsMR = golfsManual[golfsManual['Fuel Type']=='Regular'][['Year','Combined MPG']].sort_values('Year')
golfsMR.head(3)

       Year  Combined MPG
34369  1986            26
34372  1987            26
34374  1988            25

In [128]:
# To create the 'Combined MPG' difference with the previous model:
# Create a list -CMPG- from all the items from the column 'Combined MPG'
CMPG = list( golfsMR['Combined MPG'] )
CMPG

[26, 26, 25, 25, 24, 24, 24, 24, 24, 24, 24, 24, 25, 26, 26, 26, 30, 30, 29]

In [129]:
# We need to calculated the difference of MPG list, item 1 minus item 0, item 2 minus item 1 and so on, for this:
# Create a new list -diff- with the first value as 0, 
# run a While loop to append the difference with items from the Combined MPG list

diff = [0] #index 0 is always 0 since it has no other item to be compared
i=1
while i<len(CMPG):
  i+=1
  diff.append(CMPG[i-1] - CMPG[i-2])
diff

[0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 4, 0, -1]

In [130]:
# Create a new column 'MPG Difference' into the dataframe -golfsMR- using the items from the -diff- list
golfsMR['MPG Difference']=diff
golfsMR.head(5)

       Year  Combined MPG  MPG Difference
34369  1986            26               0
34372  1987            26               0
34374  1988            25              -1
34377  1989            25               0
34379  1999            24              -1

In [131]:
golfsMR.info() #verifying the datatype for the columns, we need 'Combined MPG' to be floats

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19 entries, 34369 to 34438
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Year            19 non-null     int64
 1   Combined MPG    19 non-null     int64
 2   MPG Difference  19 non-null     int64
dtypes: int64(3)
memory usage: 608.0 bytes

In [132]:
# To Turn the 'MPG Difference' items to floats:
# Iterate the colum 'MPG Difference' with a lamba function to turn each int into a float
# And add the result series into a variable -itemsToFlo-

lam = lambda x: float(x)
itemsToFlo = golfsMR['MPG Difference'].apply(lam) 
itemsToFlo

34369    0.0
34372    0.0
34374   -1.0
34377    0.0
34379   -1.0
34385    0.0
34391    0.0
34395    0.0
34399    0.0
34403    0.0
34407    0.0
34411    0.0
34412    1.0
34417    1.0
34421    0.0
34427    0.0
34431    4.0
34436    0.0
34438   -1.0
Name: MPG Difference, dtype: float64

In [133]:
# Change the colum items from 'MPG Difference' for the items in -itemsToFlo-
golfsMR['MPG Difference']=itemsToFlo
golfsMR.head(3)

       Year  Combined MPG  MPG Difference
34369  1986            26             0.0
34372  1987            26             0.0
34374  1988            25            -1.0

In [149]:
golfsMR.info() #Verify the 'MPG Difference' are floats now and the other columns are integers

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19 entries, 34369 to 34438
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Year            19 non-null     int64
 1   Combined MPG    19 non-null     int64
 2   MPG Difference  19 non-null     float64
dtypes: float64(1), int64(2)
memory usage: 608.0 bytes

In [150]:
# assign the result to the variable -Q5- with values as list
Q5 = golfsMR.values.tolist()
Q5 
#WHY the list is showing all items as floats, even when the info() for the DF shows int and float?

[[1986.0, 26.0, 0.0],
 [1987.0, 26.0, 0.0],
 [1988.0, 25.0, -1.0],
 [1989.0, 25.0, 0.0],
 [1999.0, 24.0, -1.0],
 [2000.0, 24.0, 0.0],
 [2001.0, 24.0, 0.0],
 [2002.0, 24.0, 0.0],
 [2003.0, 24.0, 0.0],
 [2004.0, 24.0, 0.0],
 [2005.0, 24.0, 0.0],
 [2006.0, 24.0, 0.0],
 [2010.0, 25.0, 1.0],
 [2011.0, 26.0, 1.0],
 [2012.0, 26.0, 0.0],
 [2013.0, 26.0, 0.0],
 [2015.0, 30.0, 4.0],
 [2016.0, 30.0, 0.0],
 [2017.0, 29.0, -1.0]]

In [151]:
#---Due to the tolist() showing all items as float for some reason---
# Create a new list -resultlist- from all colums
yearlist = list(golfsMR['Year'])
coMPGlist = list(golfsMR['Combined MPG'])
MPGDilist = list(golfsMR['MPG Difference'])

In [152]:
# Use a while loop to create a new list for each other list taking the 1st item for all and so on
# for the correct format for the input of the answer
resultlist = []
i=0
while i<(len(yearlist)):
  resultlist.append([yearlist[i],coMPGlist[i],MPGDilist[i]])
  i+=1
resultlist

Q5 = resultlist
Q5

[[1986, 26, 0.0],
 [1987, 26, 0.0],
 [1988, 25, -1.0],
 [1989, 25, 0.0],
 [1999, 24, -1.0],
 [2000, 24, 0.0],
 [2001, 24, 0.0],
 [2002, 24, 0.0],
 [2003, 24, 0.0],
 [2004, 24, 0.0],
 [2005, 24, 0.0],
 [2006, 24, 0.0],
 [2010, 25, 1.0],
 [2011, 26, 1.0],
 [2012, 26, 0.0],
 [2013, 26, 0.0],
 [2015, 30, 4.0],
 [2016, 30, 0.0],
 [2017, 29, -1.0]]

## Q6. What are the top 5 lowest CO2 Emission Grams/Mile emmisions of cars for each of the following brands: Toyota, Ford, Volkswagen, Nissan, Honda

##### Format: A 5X6 list with the first element of each row being the Make of the cars and the following five values being floats sorted in ascending order. The Makes should appear in order listed in the question starting with Ford and ending with Volkswagen (see example).


##### Example answer:

```
[['Toyota', 100.0, 140.0, 140.0, 150.0, 150.0],
 ['Ford',
  100.025641025641,
  200.677633075759575,
  200.677633075759575,
  200.677633075759575,
  200.677633075759575],
 ['Volkswagen', 139.0, 154.0, 166.5, 166.5, 166.5],
 ['Nissan', 122.0, 122.0, 122.0, 122.0, 160.0],
 ['Honda', 100.0, 100.0, 100.0, 100.0, 123.91684618442447]]
```

In [44]:
########## Q6
#Your code here

In [153]:
# Set the index to 'Make' to locate the Rows with the brands needed, and call the column 'CO2 Emission..'
# And set it to a temporary df to a better code read -DF1- and then reset the index to a new DF -co2cars-
DF1 = cars.set_index('Make').loc[['Toyota', 'Ford', 'Volkswagen', 'Nissan', 'Honda']]
co2cars = DF1[['CO2 Emission Grams/Mile']].reset_index()
co2cars

        Make  CO2 Emission Grams/Mile
0     Toyota               423.190476
1     Toyota               423.190476
2     Toyota               423.190476
3     Toyota               386.391304
4     Toyota               423.190476
...      ...                      ...
7913   Honda               444.350000
7914   Honda               444.350000
7915   Honda               444.350000
7916   Honda               423.190476
7917   Honda               423.190476

[7918 rows x 2 columns]

In [154]:
##Create a while loop to create a subindex list to group all the -Make- items in the order requested.

# 0 for Toyota, 1 for Ford, 2 for Volkswagen, 3 for 'Nissan' and 4 for 'Honda'
# Create a list with a first value 0 then the loop will compare the Make items, if the subsecuent items are equal
# the subindex will be the same number for both items (starting with 0), if are not equal then the index will be +1
# this is difined by the variable j, only increases when the comparition is not equal, meaning the brand changed

subind=[0]
cont=[]
i=0
j=0
while i<(len(co2cars.Make)-1):
    if co2cars.Make[i+1]==co2cars.Make[i]:
        subind.append(j)
    else:
        subind.append(j+1)
        j+=1
    i+=1

len(subind) #the list is the same lenght as the curren items in -Make- column

7918

In [155]:
# Create a new column 'subindex' and add the created -subind- list
# All Toyoya have a subindex 0, All Ford have a subindex 1,... All Honda have a subindex 4

co2cars['subindex']=subind
co2cars

        Make  CO2 Emission Grams/Mile  subindex
0     Toyota               423.190476         0
1     Toyota               423.190476         0
2     Toyota               423.190476         0
3     Toyota               386.391304         0
4     Toyota               423.190476         0
...      ...                      ...       ...
7913   Honda               444.350000         4
7914   Honda               444.350000         4
7915   Honda               444.350000         4
7916   Honda               423.190476         4
7917   Honda               423.190476         4

[7918 rows x 3 columns]

In [159]:
# Sort the -co2cars- first by the 'subindex' and then by 'CO2 Emission..' column and apply a groupby to 'Make' colum
# this will sort the DF with CO2 items ascending without modify the -Make- sort as requested 
# Apply a head(5) to show the 5 lower values by group and show only the'Make' and 'CO2 Emmission..'
# create a -DF2- and -gb- temporary variables for a better code reading while applying the sort and groupby

DF2 = co2cars.sort_values(['subindex','CO2 Emission Grams/Mile'])
gb = DF2.groupby(["Make"])[['subindex','Make',"CO2 Emission Grams/Mile"]].head(5)
gb

      subindex        Make  CO2 Emission Grams/Mile
1000         0      Toyota               133.000000
1001         0      Toyota               133.000000
1002         0      Toyota               133.000000
1003         0      Toyota               133.000000
998          0      Toyota               158.000000
3808         1        Ford               112.000000
2035         1        Ford               129.000000
2036         1        Ford               129.000000
2037         1        Ford               129.000000
2038         1        Ford               129.000000
5318         2  Volkswagen               200.000000
5319         2  Volkswagen               200.000000
5320         2  Volkswagen               200.000000
5321         2  Volkswagen               200.000000
5368         2  Volkswagen               261.025641
6995         3      Nissan               249.000000
6992         3      Nissan               254.000000
6624         3      Nissan               254.500000
6626         3      Nissan               254.500000
6629         3      Nissan               254.500000
7250         4       Honda               130.000000
7713         4       Honda               167.679245
7715         4       Honda               167.679245
7717         4       Honda               167.679245
7719         4       Honda               167.679245

In [160]:
# Create a second gb df -gblist- to make a list to fit of all the 'Co2 emission..' items in a single cell
# and call the column 'Co2list' using apply(list) and reseting the index with a name. 
gblist = gb.groupby(['subindex','Make'])['CO2 Emission Grams/Mile'].apply(list).reset_index(name='Co2list')
gblist

   subindex        Make                                            Co2list
0         0      Toyota                [133.0, 133.0, 133.0, 133.0, 158.0]
1         1        Ford                [112.0, 129.0, 129.0, 129.0, 129.0]
2         2  Volkswagen     [200.0, 200.0, 200.0, 200.0, 261.025641025641]
3         3      Nissan                [249.0, 254.0, 254.5, 254.5, 254.5]
4         4       Honda  [130.0, 167.67924528301887, 167.67924528301887...

In [161]:
# To fit the request format to the unit test:
# Make the colum 'Co2list' a list.
co2carlist = gblist['Co2list'].tolist()
co2carlist

[[133.0, 133.0, 133.0, 133.0, 158.0],
 [112.0, 129.0, 129.0, 129.0, 129.0],
 [200.0, 200.0, 200.0, 200.0, 261.025641025641],
 [249.0, 254.0, 254.5, 254.5, 254.5],
 [130.0,
  167.67924528301887,
  167.67924528301887,
  167.67924528301887,
  167.67924528301887]]

In [162]:
# Use a While loop to format the list -co2carlist- values to insert the name of the brand at the beginning and
# Assign it to a result variable -Q6- to fit the requested format.  Que trucazo no?

i=0
while i<(len(co2carlist)):
    co2carlist[i].insert(0,gblist['Make'][i])
    i+=1
Q6 = co2carlist
Q6

[['Toyota', 133.0, 133.0, 133.0, 133.0, 158.0],
 ['Ford', 112.0, 129.0, 129.0, 129.0, 129.0],
 ['Volkswagen', 200.0, 200.0, 200.0, 200.0, 261.025641025641],
 ['Nissan', 249.0, 254.0, 254.5, 254.5, 254.5],
 ['Honda',
  130.0,
  167.67924528301887,
  167.67924528301887,
  167.67924528301887,
  167.67924528301887]]

## Q7. Form 7 groups of 5 years to calculated the median Combined MPG of each group. The first group is from 1984 to 1988, the second from 1989 to 1993 and so on. The last group will have years not appearing in the dataset.

##### Note: The groups ranges are inclusive on both sides, the first group starts with 1984 and cars from 1984 are included in it.
##### Format : A 7X2 list with the first element of each row being a tuple of two integers being the lower and uppper range of the year groups and the esecond element being the median Combined MPG of that group, a float number.

##### Example answer:


```
[[(1984, 1988), 11.0],
 [(1989, 1993), 10.0],
 [(1994, 1998), 10.0],
 [(1999, 2003), 14.0],
 [(2004, 2008), 13.0],
 [(2009, 2013), 14.0],
 [(2014, 2018), 15.0]]
```

In [53]:
########## Q7
#Your code here

# Groupby 'Year' and aggregate the'Combined MPG':'median', reset the index and save a new DF -gbMPG-
gb = cars.groupby(['Year']).agg({'Combined MPG':'median'})
gbMPG = gb.reset_index()
gbMPG.head(3)

   Year  Combined MPG
0  1984          17.0
1  1985          19.0
2  1986          19.0

In [97]:
# We need to use bins, with a range of 5 year each, starting from 1983 (to include 1984 cars) to 1988 and so on.
# We create the labes with the offset to fall in the correct number of years (1984 to 1988... etc)
# Using pd.cut create a column with the Grouped Years 'grYears' and set it to the index accordingly to MPG

bins = (1983, 1988, 1993, 1998, 2003, 2008, 2013, np.inf)
labels = ((1984, 1988),(1989, 1993), (1994, 1998), (1999, 2003), (2004, 2008), (2009, 2013), (2014, 2018))
gbMPG['grYears'] = pd.cut(gbMPG.Year, bins=bins, labels=labels)
gbMPG

    Year  Combined MPG       grYears
0   1984          17.0  (1984, 1988)
1   1985          19.0  (1984, 1988)
2   1986          19.0  (1984, 1988)
3   1987          19.0  (1984, 1988)
4   1988          19.0  (1984, 1988)
5   1989          19.0  (1989, 1993)
6   1990          18.0  (1989, 1993)
7   1991          18.0  (1989, 1993)
8   1992          18.0  (1989, 1993)
9   1993          18.0  (1989, 1993)
10  1994          18.0  (1994, 1998)
11  1995          18.0  (1994, 1998)
12  1996          19.0  (1994, 1998)
13  1997          19.0  (1994, 1998)
14  1998          19.0  (1994, 1998)
15  1999          19.0  (1999, 2003)
16  2000          19.0  (1999, 2003)
17  2001          19.0  (1999, 2003)
18  2002          19.0  (1999, 2003)
19  2003          19.0  (1999, 2003)
20  2004          19.0  (2004, 2008)
21  2005          19.0  (2004, 2008)
22  2006          19.0  (2004, 2008)
23  2007          19.0  (2004, 2008)
24  2008          19.0  (2004, 2008)
25  2009          20.0  (2009, 2013)
26  2010          20.0  (2009, 2013)
27  2011          21.0  (2009, 2013)
28  2012          21.0  (2009, 2013)
29  2013          22.0  (2009, 2013)
30  2014          22.0  (2014, 2018)
31  2015          22.0  (2014, 2018)
32  2016          23.0  (2014, 2018)
33  2017          23.0  (2014, 2018)

In [164]:
# Groupby using the colum 'grYears' and applying the median to 'Combined MPG' values,
#Â Reset the index of the gb and assign it to a new DF -MPGyears- for a cleaner read of code
MPGyears = gbMPG.groupby('grYears')['Combined MPG'].agg({'median'}).reset_index()
MPGyears

        grYears  median
0  (1984, 1988)    19.0
1  (1989, 1993)    18.0
2  (1994, 1998)    19.0
3  (1999, 2003)    19.0
4  (2004, 2008)    19.0
5  (2009, 2013)    21.0
6  (2014, 2018)    22.5

In [165]:
# Transform the DF -MPGyears- to a list and assign it to the -Q7- result variable
Q7 = MPGyears.values.tolist()
Q7

[[(1984, 1988), 19.0],
 [(1989, 1993), 18.0],
 [(1994, 1998), 19.0],
 [(1999, 2003), 19.0],
 [(2004, 2008), 19.0],
 [(2009, 2013), 21.0],
 [(2014, 2018), 22.5]]

## Test your answers

##### We provide you some tests to make sure your answer dictionary is in the correct format using unittest.
##### These tests are not meant to be comprehensive, you should review all your answers carefully.

In [171]:
import unittest

class TestAnswers(unittest.TestCase):
    def test_if_dict(self):
        self.assertIsInstance(answer_dict, dict)

    def test_keys(self):
        self.assertEqual(list(answer_dict.keys()), ['Q1', 'Q2', 'Q3', 'Q4', 'Q5', 'Q6', 'Q7'])

    def test_answers_types(self):
        types_values = [type(k) for k in answer_dict.values()]
        answer_types = [float, list, list, list, list, list, list]
        self.assertEqual(types_values, answer_types)

    def test_Q1(self):
        self.assertEqual(type(answer_dict['Q1']), float)

    def test_Q2_dim(self):
        self.assertEqual(np.array(answer_dict['Q2']).shape, (5,2))

    def test_Q2_types(self):
        dtype1 = type(answer_dict['Q2'][0][0])
        dtype2 = type(answer_dict['Q2'][0][1])
        self.assertEqual([dtype1, dtype2], [str, int])

    def test_Q3_types(self):
        q3_types = set([type(item) for item in answer_dict['Q3']])
        self.assertEqual(q3_types, {str})

    def test_Q4_dim(self):
        self.assertEqual(np.array(answer_dict['Q4']).shape, (9,3))

    def test_Q4_types(self):
        dtype1 = type(answer_dict['Q4'][0][0])
        dtype2 = type(answer_dict['Q4'][0][1])
        dtype3 = type(answer_dict['Q4'][0][2])
        self.assertEqual([dtype1, dtype2, dtype3], [str, int, float])

    def test_Q5_dim(self):
        self.assertEqual(np.array(answer_dict['Q5']).shape, (19,3))

    def test_Q5_types(self):
        dtype1 = type(answer_dict['Q5'][0][0])
        dtype2 = type(answer_dict['Q5'][0][1])
        dtype3 = type(answer_dict['Q5'][0][2])
        self.assertEqual([dtype1, dtype2, dtype3], [int, int, float])

    def test_Q5_first_zero(self):
        self.assertEqual(answer_dict['Q5'][0][2], 0)


    def test_Q6_dim(self):
        self.assertEqual(np.array(answer_dict['Q6']).shape, (5,6))

    def test_Q5_types(self):
        dtype1 = type(answer_dict['Q6'][0][0])
        dtype2 = type(answer_dict['Q6'][0][1])
        dtype3 = type(answer_dict['Q6'][0][2])
        dtype4 = type(answer_dict['Q6'][0][3])
        dtype5 = type(answer_dict['Q6'][0][4])
        dtype6 = type(answer_dict['Q6'][0][5])
        self.assertEqual([dtype1, dtype2, dtype3, dtype4, dtype5, dtype6], [str, float, float, float, float, float])

    def test_Q6_check_first_and_last_brand(self):
        first_brand = answer_dict['Q6'][0][0]
        last_brand = answer_dict['Q6'][4][0]

        self.assertEqual([first_brand, last_brand], ["Toyota", "Honda"])

    def test_Q7_dim(self):
        self.assertEqual(np.array(answer_dict['Q7'], dtype=object).shape, (7,2))

    def test_Q7_types(self):
        dtype1 = type(answer_dict['Q7'][0][0])
        dtype2 = type(answer_dict['Q7'][0][1])
        self.assertEqual([dtype1, dtype2], [tuple, float])

unittest.main(argv=[''], verbosity=2, exit=False)

test_Q1 (__main__.TestAnswers) ... ok
test_Q2_dim (__main__.TestAnswers) ... ok
test_Q2_types (__main__.TestAnswers) ... ok
test_Q3_types (__main__.TestAnswers) ... ok
test_Q4_dim (__main__.TestAnswers) ... ok
test_Q4_types (__main__.TestAnswers) ... ok
test_Q5_dim (__main__.TestAnswers) ... ok
test_Q5_first_zero (__main__.TestAnswers) ... ok
test_Q5_types (__main__.TestAnswers) ... ok
test_Q6_check_first_and_last_brand (__main__.TestAnswers) ... ok
test_Q6_dim (__main__.TestAnswers) ... ok
test_Q7_dim (__main__.TestAnswers) ... ok
test_Q7_types (__main__.TestAnswers) ... ok
test_answers_types (__main__.TestAnswers) ... ok
test_if_dict (__main__.TestAnswers) ... ok
test_keys (__main__.TestAnswers) ... ok

----------------------------------------------------------------------
Ran 16 tests in 0.026s

OK

## Save your answers


##### First, take a moment to evaluate your answers and make sure you have not missed anything

##### Use the following code to save your answers in pickle format, change the filename using the following format:
##### FIRSTNAME_LASTNAME_answers.pkl
##### Example: Juan_Perez_answers.pkl

##### If you are using google colab you can find your file on the left side bar by clicking the folder icon inside the sample_data folder. Remember to upload the pickle file and the notebook to github and submit their URLs to the [google form](https://forms.gle/wWysZEMkoZsjB11Y7).

In [170]:
answer_dict

{'Q1': 392.7417210857633,
 'Q2': [['Mercedes-Benz', 333],
  ['BMW', 284],
  ['Chevrolet', 253],
  ['Ford', 185],
  ['GMC', 163]],
 'Q3': ['CNG',
  'Diesel',
  'Gasoline or E85',
  'Gasoline or natural gas',
  'Gasoline or propane',
  'Midgrade',
  'Premium',
  'Premium Gas or Electricity',
  'Premium and Electricity',
  'Premium or E85',
  'Regular',
  'Regular Gas and Electricity',
  'Regular Gas or Electricity'],
 'Q4': [['Cab/Chassis 2WD', 1993, 4.1122558654247925],
  ['Cab/Chassis 2WD', 1992, 4.1122558654247925],
  ['Cab/Chassis 2WD', 1991, 4.1122558654247925],
  ['Cab/Chassis 2WD', 1990, 4.1122558654247925],
  ['Cab/Chassis 2WD', 1989, 4.1122558654247925],
  ['Camry CNG', 1999, -3.932541757118491],
  ['Camry CNG', 2001, -3.9316423754756538],
  ['Camry CNG', 2000, -3.9316423754756538],
  ['Cab/Chassis 2WD', 1993, 3.3791118637260937]],
 'Q5': [[1986, 26, 0.0],
  [1987, 26, 0.0],
  [1988, 25, -1.0],
  [1989, 25, 0.0],
  [1999, 24, -1.0],
  [2000, 24, 0.0],
  [2001, 24, 0.0],
  [2002, 24, 0.0],
  [2003, 24, 0.0],
  [2004, 24, 0.0],
  [2005, 24, 0.0],
  [2006, 24, 0.0],
  [2010, 25, 1.0],
  [2011, 26, 1.0],
  [2012, 26, 0.0],
  [2013, 26, 0.0],
  [2015, 30, 4.0],
  [2016, 30, 0.0],
  [2017, 29, -1.0]],
 'Q6': [['Toyota', 133.0, 133.0, 133.0, 133.0, 158.0],
  ['Ford', 112.0, 129.0, 129.0, 129.0, 129.0],
  ['Volkswagen', 200.0, 200.0, 200.0, 200.0, 261.025641025641],
  ['Nissan', 249.0, 254.0, 254.5, 254.5, 254.5],
  ['Honda',
   130.0,
   167.67924528301887,
   167.67924528301887,
   167.67924528301887,
   167.67924528301887]],
 'Q7': [[(1984, 1988), 19.0],
  [(1989, 1993), 18.0],
  [(1994, 1998), 19.0],
  [(1999, 2003), 19.0],
  [(2004, 2008), 19.0],
  [(2009, 2013), 21.0],
  [(2014, 2018), 22.5]]}

In [172]:
import pickle

file_name = "Gerardo_Peralta_answers.pkl"
path = "/Users/geperalta/Downloads/"

with open(path+file_name, 'wb') as f:
    pickle.dump(answer_dict, f, protocol=pickle.HIGHEST_PROTOCOL)